# NewFamilyInstanceCreationData Method (Face, XYZ, XYZ, FamilySymbol)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Application..::..NewFamilyInstanceCreationData Method (Face, XYZ, XYZ, FamilySymbol)
Application Class See Also
---
Creates an object which wraps the arguments of NewFamilyInstance() for batch creation.
**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public FamilyInstanceCreationData NewFamilyInstanceCreationData(
	Face face,
	XYZ location,
	XYZ referenceDirection,
	FamilySymbol symbol
)
```

Visual Basic
---
```text
Public Function NewFamilyInstanceCreationData ( _
	face As Face, _
	location As XYZ, _
	referenceDirection As XYZ, _
	symbol As FamilySymbol _
) As FamilyInstanceCreationData
```

Visual C++
---
```text
public:
FamilyInstanceCreationData^ NewFamilyInstanceCreationData(
	Face^ face,
	XYZ^ location,
	XYZ^ referenceDirection,
	FamilySymbol^ symbol
)
```

# ### Parameters
face
    Type: Autodesk.Revit.DB..::..FaceA face of a geometry object.
location
    Type: Autodesk.Revit.DB..::..XYZPoint on the face where the instance is to be placed.
referenceDirection
    Type: Autodesk.Revit.DB..::..XYZA vector that defines the direction of the family instance.
symbol
    Type: Autodesk.Revit.DB..::..FamilySymbolA FamilySymbol object that represents the type of the instance that is to be inserted.
# See Also
Application Class
NewFamilyInstanceCreationData Overload
Autodesk.Revit.Creation Namespace